syfchao/STM32_RTT_F107/ECU/main/src/zigbee.c
	return 0;
}

int process_turn_on_off(inverter_info *firstinverter)
{
	int i, j;
	FILE *fp;
	char command[256] = {'\0'};
	inverter_info *curinverter = firstinverter;

	fp = fopen("/tmp/connect.con", "r");
	if(!fp)
		return -1;
	while(1){
		curinverter = firstinverter;
		memset(command, '\0', 256);
		fgets(command, 256, fp);
		if(!strlen(command))
			break;
		if('\n' == command[strlen(command)-1])
			command[strlen(command)-1] = '\0';
		if(!strncmp(command, "connect all", 11)){
			zb_turnon_inverter_broadcast();
			printmsg(ECU_DBG_MAIN,"turn on all");
			break;
		}
		if(!strncmp(command, "disconnect all", 14)){
			zb_shutdown_broadcast();
			printmsg(ECU_DBG_MAIN,"turn off all");
			break;
		}

		for(i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++){
			if(!strncmp(command, curinverter->id, 12))
			{
				j = 0;
				if('c' == command[12])
				{
					while(j<3)
					{
						if(1 == zb_boot_single(curinverter))
						{
							print2msg(ECU_DBG_MAIN,"turn on", curinverter->id);
							break;
						}
						j++;
					}
				}
				if('d' == command[12])
				{
					while(j<3)
					{
						if(1 == zb_shutdown_single(curinverter))
						{
							print2msg(ECU_DBG_MAIN,"turn off", curinverter->id);
							break;
						}
						j++;
					}
				}
			}
			curinverter++;
		}
	}

	fclose(fp);
	fp = fopen("/tmp/connect.con", "w");
	fclose(fp);

	return 0;

}

int process_quick_boot(inverter_info *firstinverter)
{
	int i;
	FILE *fp;
	char flag_quickboot = '0';				//快速启动标志
	inverter_info *curinverter = firstinverter;

	fp = fopen("/tmp/qckboot.con", "r");

	if(fp)
	{
		flag_quickboot = fgetc(fp);
		fclose(fp);
		if('1' == flag_quickboot)
		{
			curinverter = firstinverter;
			for(i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++)
			{
				zb_boot_waitingtime_single(curinverter);
				print2msg(ECU_DBG_MAIN,"quick boot",curinverter->id);
				curinverter++;
			}
		}
		fp = fopen("/tmp/qckboot.con", "w");
		if(fp)
		{
			fputs("0",fp);
			fclose(fp);
		}
	}
	return 0;

}

int process_ipp(inverter_info *firstinverter)
{
	int i, j;
	FILE *fp;
	char command[256] = {'\0'};
	inverter_info *curinverter = firstinverter;

	fp = fopen("/tmp/ipp.con", "r");

	if(fp)
	{
		while(1)
		{
			curinverter = firstinverter;
			memset(command, '\0', 256);
			fgets(command, 256, fp);
			if(!strlen(command))
				break;
			if('\n' == command[strlen(command)-1])
				command[strlen(command)-1] = '\0';
			if(!strncmp(command, "set ipp all", 11)){
				zb_ipp_broadcast();
				printmsg(ECU_DBG_MAIN,"set ipp all");
				break;
			}

			for(i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++){
				if(!strcmp(command, curinverter->id))
				{
					j=0;
					while(j<3)
					{
						if(1 == zb_ipp_single(curinverter))
						{
							print2msg(ECU_DBG_MAIN,"set ipp single", curinverter->id);
							break;
						}
						j++;
					}
					break;
				}
				curinverter++;
			}
		}

		fclose(fp);
	}
	fp = fopen("/tmp/ipp.con", "w");
	fclose(fp);

	return 0;


}




int process_all(inverter_info *firstinverter)
{
	processpower(firstinverter);			//设置功率预设值,ZK,3.10有改动	     OK
//	process_gfdi(firstinverter);			//清GFDI标志
//	process_protect_data(firstinverter);	//设置预设值
	process_turn_on_off(firstinverter);		//开关机 	用于DRM功能
	process_quick_boot(firstinverter);		//快速启动
	process_ipp(firstinverter);				//IPP设定
	process_ird_all(firstinverter);		//0K
	process_ird(firstinverter);
	turn_on_off(firstinverter);								//开关机,ZK,3.10所加	   OK
	clear_gfdi(firstinverter);								//清GFDI标志,ZK,3.10所加 OK
	set_protection_parameters(firstinverter);				//设置预设值广播,ZK,3.10所加
	set_protection_parameters_inverter_one(firstinverter);  //设置预设值单点,ZK,3.10所加

	
	//save_A145_inverter_to_all();
	return 0;
}

int getalldata(inverter_info *firstinverter,int time_linux)		//获取每个逆变器的数据
{
	int i, j,dataflag_clear = 0;
	inverter_info *curinverter = firstinverter;
	int count=0, syspower=0;
	float curenergy=0;
	int out_flag = 0;	//跳出查询标志
#if 0
	char buff[50] = {'\0'};
	int fd;
#endif 

	for(i=0;i<3;i++)
	{
		if(-1==zb_test_communication())
		{
			zigbee_reset();	
		}	
		else
			break;
	}
	//calibration_time_broadcast(firstinverter, time_linux); 	//YC1000补报：广播校准时间
	process_all(firstinverter);
	for(j=0; j<5; j++)
	{
		out_flag = 0;
		curinverter = firstinverter;
		
		for(i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++)			//每个逆变器最多要5次数据
		{
			if(dataflag_clear == 0)
			{
				curinverter->inverterstatus.dataflag = 0;		//没有接收到数据就置为0
				curinverter->dv=0;
				curinverter->di=0;
				curinverter->op=0;
				curinverter->gf=0;
				curinverter->it=0;
				curinverter->gv=0;

				curinverter->dvb=0;
				curinverter->dib=0;
				curinverter->opb=0;

				curinverter->curgeneration = 0;
				curinverter->curgenerationb = 0;
				curinverter->status_send_flag=0;

				rt_memset(curinverter->status_web, '\0', sizeof(curinverter->status_web));		//????????
				rt_memset(curinverter->status, '\0', sizeof(curinverter->status));
				rt_memset(curinverter->statusb, '\0', sizeof(curinverter->statusb));
			}
			
			if((0 == curinverter->inverterstatus.dataflag) && (0 != curinverter->shortaddr))
			{
				if(1 != curinverter->inverterstatus.bindflag)
				{
					if(1 == zb_turnoff_limited_rptid(curinverter->shortaddr,curinverter))
					{
						curinverter->inverterstatus.bindflag = 1;			//绑定逆变器标志位1
						updateID();	
					}else
						out_flag = 1;
					
				}
				if((0 == curinverter->model) )//&& (1 == curinverter->inverterstatus.bindflag))
				{
					if(1 == zb_query_inverter_info(curinverter))
						updateID();
					else
						out_flag = 1;
					
				}
				
				if((0 != curinverter->model) )//&& (1 == curinverter->inverterstatus.bindflag))
				{
					//print2msg(ECU_DBG_MAIN,"querydata",curinverter->id);
					if(-1 == zb_query_data(curinverter))
						out_flag = 1;
					rt_hw_us_delay(200000);
				}
			}
			curinverter++;
		}
		dataflag_clear = 1;
		if(out_flag == 0) break;
	}
	ecu.polling_total_times++;				//ECU总轮训加1 ,ZK
#if 0	
	fd = open("/TMP/DISCON.TXT", O_WRONLY | O_CREAT | O_TRUNC, 0);
	if (fd >= 0) {
		curinverter = firstinverter;
		for(i=0; i<MAXINVERTERCOUNT; i++, curinverter++)						//统计当前一天逆变器与ECU没通讯上的总次数, ZK
		{
			if((0 == curinverter->inverterstatus.dataflag)&&(12 == strlen(curinverter->id)))
			{
				curinverter->disconnect_times++;
				if(curinverter->disconnect_times > 254)
				{
					curinverter->disconnect_times= 254;
				}
				sprintf(buff, "%s-%d-%d\n", curinverter->id,curinverter->disconnect_times,ecu.polling_total_times);
				write(fd, buff, strlen(buff));
			}
			else if((1 == curinverter->inverterstatus.dataflag)&&(12 == strlen(curinverter->id)))
			{
				sprintf(buff, "%s-%d-%d\n", curinverter->id,curinverter->disconnect_times,ecu.polling_total_times);
				write(fd, buff, strlen(buff));
			}
		}
		close(fd);
	}
#endif 
	curinverter = firstinverter;
	for(i=0; i<MAXINVERTERCOUNT; i++, curinverter++)		//统计连续没有获取到数据的逆变器 ZK,一旦接收到数据，此变量清零
	{
		if((0 == curinverter->inverterstatus.dataflag)&&(12 == strlen(curinverter->id)))
		{
			curinverter->no_getdata_num++;
			if(curinverter->no_getdata_num>254)
			{
				curinverter->no_getdata_num = 254;
			}
		}
	}

	curinverter = firstinverter;
	for(i=0; i<MAXINVERTERCOUNT; i++, curinverter++){							//统计当前多少个逆变器
		if((1 == curinverter->inverterstatus.dataflag)&&(12 == strlen(curinverter->id)))
			count++;
	}
	ecu.count = count;

	curinverter = firstinverter;
	for(syspower=0, i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++, curinverter++){		//计算当前一轮系统功率
		if(1 == curinverter->inverterstatus.dataflag){
			syspower += curinverter->op;
			syspower += curinverter->opb;
			syspower += curinverter->opc;
			syspower += curinverter->opd;
		}
	}
	ecu.system_power = syspower;

	curinverter = firstinverter;
	for(curenergy=0, i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++, curinverter++){		//计算当前一轮发电量
		if(1 == curinverter->inverterstatus.dataflag){
			if((curinverter->model==5) || (curinverter->model==6) || (curinverter->model==7) || (curinverter->model==0x17))
				{
					curenergy += curinverter->curgeneration;
					curenergy += curinverter->curgenerationb;
					curenergy += curinverter->curgenerationc;
					curenergy += curinverter->curgenerationd;
				}else
				{
					curenergy += curinverter->output_energy;
					curenergy += curinverter->output_energyb;
					curenergy += curinverter->output_energyc;			
				}

