syfchao/STM32_RTT_F107/ECU/main/src/zigbee.c
		}
	}
	ecu.current_energy = curenergy;
	update_tmpdb(firstinverter);
#if 0
	fd = open("/TMP/IDNOBIND.TXT", O_WRONLY | O_CREAT | O_TRUNC, 0); 	//为了统计显示有短地址但是没有绑定的逆变器ID
	if (fd >= 0) 
	{						

		curinverter = firstinverter;
		for(i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++, curinverter++)
		{
			if((1!=curinverter->inverterstatus.bindflag)&&(0!=curinverter->shortaddr))
			{
				memset(buff,0,50);
				sprintf(buff,"%s\n",curinverter->id);
				write(fd, buff, strlen(buff));
			}
		}
		close(fd);
	}

	fd = open("/TMP/SIGNALST.TXT", O_WRONLY | O_CREAT | O_TRUNC, 0);
	if (fd >= 0) 
	{			
		curinverter = firstinverter;
		for(i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++, curinverter++)	 //统计每天逆变器的信号强度, ZK
		{
			memset(buff,0,50);
			sprintf(buff, "%s%X\n", curinverter->id,curinverter->signalstrength);
			write(fd, buff, strlen(buff));

		}
		close(fd);
	}

	fd = open("/TMP/RADUIS.TXT", O_WRONLY | O_CREAT | O_TRUNC, 0);
	if (fd >= 0) 
	{			
		curinverter = firstinverter;
		for(i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++, curinverter++)	 //统计每台逆变器的信号强度, ZK
		{
			memset(buff,0,50);
			sprintf(buff, "%s%X\n", curinverter->id,curinverter->raduis);
			write(fd, buff, strlen(buff));
		}
		close(fd);
	}


	write_gfdi_status(firstinverter);
	write_turn_on_off_status(firstinverter);
#endif
	save_turn_on_off_changed_result(firstinverter);
	save_gfdi_changed_result(firstinverter);

	return ecu.count;
}

int get_inverter_shortaddress(inverter_info *firstinverter)		//获取没有数据的逆变器的短地址
{
	int i;
	inverter_info *curinverter = firstinverter;
	unsigned short current_panid;				//Zigbee即时的PANID
	int flag = 0;


	curinverter = firstinverter;
	for(i=0; (i<MAXINVERTERCOUNT)&&(12==rt_strlen(curinverter->id)); i++)
	{
		if((0==curinverter->shortaddr)||(curinverter->no_getdata_num>5))
		{
			flag=1;
			break;
		}
		curinverter++;
	}

	if(1==flag)
	{
		if(1==zb_restore_ecu_panid_0xffff(0x10))		//把ECU的PANID设置为默认的0xffff
			current_panid = 0xffff;
		printdecmsg(ECU_DBG_MAIN,"PANID",current_panid);
		rt_hw_s_delay(5);


		curinverter = firstinverter;
		for(i=0; (i<MAXINVERTERCOUNT)&&(12==rt_strlen(curinverter->id)); i++)
		{
			if((0==curinverter->shortaddr)||(curinverter->no_getdata_num>5))
			{
				zb_change_inverter_panid_single(curinverter);		//把没有数据的逆变器PANID修改成ECU的PANID
				rt_hw_us_delay(500000);
			}
			curinverter++;
		}

		if(1==zb_change_ecu_panid())						//把ECU的panid改成此台ECU原本panid
			current_panid = ecu.panid;
		printdecmsg(ECU_DBG_MAIN,"PANID",current_panid);
		rt_hw_s_delay(5);

		curinverter = firstinverter;
		for(i=0; (i<MAXINVERTERCOUNT)&&(12==rt_strlen(curinverter->id)); i++)
		{
			printdecmsg(ECU_DBG_MAIN,"no_getdata_num",curinverter->no_getdata_num);
			if((0==curinverter->shortaddr)||(curinverter->no_getdata_num>5))
			{
				zb_get_inverter_shortaddress_single(curinverter);
			}
			curinverter++;
		}
	}
	return 1;
}

int bind_nodata_inverter(inverter_info *firstinverter)		//绑定没有数据的逆变器,并且获取短地址
{
	int i;
	inverter_info *curinverter = firstinverter;

	curinverter = firstinverter;
	for(i=0; (i<MAXINVERTERCOUNT)&&(12==rt_strlen(curinverter->id)); i++)
	{
		if(curinverter->no_getdata_num>0)
		{
//			zb_turnoff_limited_rptid(curinverter->shortaddr,curinverter);
			zb_get_inverter_shortaddress_single(curinverter);
		}
		curinverter++;
	}
	return 0;
}

//单点改变逆变器的PANID为ECU的MAC地址后四位,信道为指定信道(注:需要将ECU的PANID改为0xFFFF(万能发送))
int zb_change_inverter_channel_one(char *inverter_id, int channel)
{
	char sendbuff[256] = {'\0'};
	int i;
	int check=0;
	rt_hw_ms_delay(500); 

	clear_zbmodem();
	sendbuff[0]  = 0xAA;
	sendbuff[1]  = 0xAA;
	sendbuff[2]  = 0xAA;
	sendbuff[3]  = 0xAA;
	sendbuff[4]  = 0x0F;
	sendbuff[5]  = 0x00;
	sendbuff[6]  = 0x00;
	sendbuff[7]  = ecu.panid>>8;
	sendbuff[8]  = ecu.panid;
	sendbuff[9]  = channel;
	sendbuff[10] = 0x00;
	sendbuff[11] = 0xA0;
	for(i=4;i<12;i++)
		check=check+sendbuff[i];
	sendbuff[12] = check/256;
	sendbuff[13] = check%256;
	sendbuff[14] = 0x06;
	sendbuff[15]=((inverter_id[0]-0x30)*16+(inverter_id[1]-0x30));
	sendbuff[16]=((inverter_id[2]-0x30)*16+(inverter_id[3]-0x30));
	sendbuff[17]=((inverter_id[4]-0x30)*16+(inverter_id[5]-0x30));
	sendbuff[18]=((inverter_id[6]-0x30)*16+(inverter_id[7]-0x30));
	sendbuff[19]=((inverter_id[8]-0x30)*16+(inverter_id[9]-0x30));
	sendbuff[20]=((inverter_id[10]-0x30)*16+(inverter_id[11]-0x30));
	ZIGBEE_SERIAL.write(&ZIGBEE_SERIAL,0, sendbuff, 21);
	printhexmsg(ECU_DBG_MAIN,"Change Inverter Channel (one)", sendbuff, 21);

	rt_hw_s_delay(1); //此处延时必须大于1S
	return 0;
}

//关闭逆变器ID上报 + 绑定逆变器
int zb_off_report_id_and_bind(int short_addr)
{
	int times = 3;
	char sendbuff[16] = {'\0'};
	char recvbuff[256] = {'\0'};
	int i;
	int check=0;

	do {
		//发送关闭逆变器ID上报+绑定操作
		clear_zbmodem();
		sendbuff[0]  = 0xAA;
		sendbuff[1]  = 0xAA;
		sendbuff[2]  = 0xAA;
		sendbuff[3]  = 0xAA;
		sendbuff[4]  = 0x08;
		sendbuff[5]  = short_addr>>8;
		sendbuff[6]  = short_addr;
		sendbuff[7]  = 0x00; //PANID(逆变器不解析)
		sendbuff[8]  = 0x00; //PANID(逆变器不解析)
		sendbuff[9]  = 0x00; //信道(逆变器不解析)
		sendbuff[10] = 0x00; //功率(逆变器不解析)
		sendbuff[11] = 0xA0;
		for(i=4;i<12;i++)
			check=check+sendbuff[i];
		sendbuff[12] = check/256;
		sendbuff[13] = check%256;
		sendbuff[14] = 0x00;
		ZIGBEE_SERIAL.write(&ZIGBEE_SERIAL,0, sendbuff, 15);
		printhexmsg(ECU_DBG_MAIN,"Bind ZigBee", sendbuff, 15);

		//接收逆变器应答(短地址,ZigBee版本号,信号强度)
		if ((11 == zb_get_reply_from_module(recvbuff))
				&& (0xA5 == recvbuff[2])
				&& (0xA5 == recvbuff[3])) {
			//update_turned_off_rpt_flag(short_addr, (int)recvbuff[9]);
			//update_bind_zigbee_flag(short_addr);
			printmsg(ECU_DBG_MAIN,"Bind Successfully");
			return 1;
		}
	}while(--times);

	return 0;
}

int zigbeeRecvMsg(char *data, int timeout_sec)
{
	int count;
	if (selectZigbee(timeout_sec*100) <= 0) {
		printmsg(ECU_DBG_MAIN,"Get reply time out");
		return -1;
	} else {
		
		count = ZIGBEE_SERIAL.read(&ZIGBEE_SERIAL,0, data, 255);
		printhexmsg(ECU_DBG_MAIN,"Reply", data, count);
		return count;
	}
}

#if 0
#ifdef RT_USING_FINSH
#include <finsh.h>
FINSH_FUNCTION_EXPORT(zigbee_reset, reset zigbee module.)
void Zbtestcomm()		//测试通信
{
	zb_test_communication();
}
FINSH_FUNCTION_EXPORT(Zbtestcomm,zigbee test communication.)

void Zbecupanidffff(int channel)		//设置ECU panid为ffff 信道为channel
{
	zb_restore_ecu_panid_0xffff(channel);
}
FINSH_FUNCTION_EXPORT(Zbecupanidffff,zb_restore_ecu_panid_0xffff channel[int].)
	
void Zbecupanid()		//设置ECU panid 以及 信道   为ECU全局变量的值	
{
	zb_change_ecu_panid();
}
FINSH_FUNCTION_EXPORT(Zbecupanid,zb_change_ecu_panid.)

void Zbecupanid8888(int channel)	//设置ECU panid为0x8888  信道我ECU全局变量的值
{
	zb_restore_ecu_panid_0x8888();
}
FINSH_FUNCTION_EXPORT(Zbecupanid8888,zb_restore_ecu_panid_0x8888.)

void Zbinvchone(char *inverter_id, int channel)	//更改逆变器panid和信道 其中panid为全局变量ecu的信道
{
	zb_change_inverter_channel_one(inverter_id,channel);
}
FINSH_FUNCTION_EXPORT(Zbinvchone,zb_change_inverter_channel_one inverter_id[char *12] channel[int].)

void Zbgetshadd(char *inverter_id)	//获取逆变器短地址
{
	inverter_info inverter;
	rt_memset(&inverter,0x00,sizeof(inverter));
	rt_memcpy(inverter.id,inverter_id,12);
	zb_get_inverter_shortaddress_single(&inverter);
}
FINSH_FUNCTION_EXPORT(Zbgetshadd,zb_get_inverter_shortaddress_single inverter_id[char *12].)

void Zbgetdata(char *inverter_id)	//获取数据
{
	inverter_info inverter;
	rt_memset(&inverter,0x00,sizeof(inverter));
	rt_memcpy(inverter.id,inverter_id,12);
	inverter.model = 7;
	zb_get_inverter_shortaddress_single(&inverter);
	zb_query_data(&inverter);
}
FINSH_FUNCTION_EXPORT(Zbgetdata,zb_query_data inverter_id[char *12].)
#endif
#endif

#ifdef RT_USING_FINSH
#include <finsh.h>

FINSH_FUNCTION_EXPORT(zigbee_reset , zigbee_reset.)
#endif

